test_results/ab_c100_n100_run3.log
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        Werkzeug/1.0.1
Server Hostname:        localhost
Server Port:            5001

Document Path:          /fetch_data
Document Length:        215 bytes

Concurrency Level:      100
Time taken for tests:   1.232 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      36100 bytes
HTML transferred:       21500 bytes
Requests per second:    81.19 [#/sec] (mean)
Time per request:       1231.622 [ms] (mean)
Time per request:       12.316 [ms] (mean, across all concurrent requests)
Transfer rate:          28.62 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   29   9.3     29      44
Processing:    67  611 322.1    595    1163
Waiting:        9  599 325.3    592    1161
Total:         68  639 313.9    624    1176

Percentage of the requests served within a certain time (ms)
  50%    624
  66%    820
  75%    938
  80%    980
  90%   1093
  95%   1137
  98%   1175
  99%   1176
 100%   1176 (longest request)