test_results/ab_c100_n100_run4.log
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        Werkzeug/1.0.1
Server Hostname:        localhost
Server Port:            5001

Document Path:          /fetch_data
Document Length:        216 bytes

Concurrency Level:      100
Time taken for tests:   1.274 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      36200 bytes
HTML transferred:       21600 bytes
Requests per second:    78.49 [#/sec] (mean)
Time per request:       1274.109 [ms] (mean)
Time per request:       12.741 [ms] (mean, across all concurrent requests)
Transfer rate:          27.75 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   29   8.3     28      45
Processing:    62  634 338.0    645    1197
Waiting:       15  622 340.5    637    1195
Total:         62  663 331.1    672    1212

Percentage of the requests served within a certain time (ms)
  50%    672
  66%    865
  75%    967
  80%   1012
  90%   1129
  95%   1180
  98%   1208
  99%   1212
 100%   1212 (longest request)