test_results/ab_c10_n10000_run2.log
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        Werkzeug/1.0.1
Server Hostname:        localhost
Server Port:            5001

Document Path:          /fetch_data
Document Length:        215 bytes

Concurrency Level:      10
Time taken for tests:   123.963 seconds
Complete requests:      10000
Failed requests:        7625
   (Connect: 0, Receive: 0, Length: 7625, Exceptions: 0)
Total transferred:      3615795 bytes
HTML transferred:       2155795 bytes
Requests per second:    80.67 [#/sec] (mean)
Time per request:       123.963 [ms] (mean)
Time per request:       12.396 [ms] (mean, across all concurrent requests)
Transfer rate:          28.48 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.2      0       7
Processing:    18  123  17.1    121     235
Waiting:       10  112  15.1    110     214
Total:         19  124  17.1    122     235
ERROR: The median and mean for the initial connection time are more than twice the standard
       deviation apart. These results are NOT reliable.

Percentage of the requests served within a certain time (ms)
  50%    122
  66%    128
  75%    133
  80%    136
  90%    146
  95%    154
  98%    166
  99%    174
 100%    235 (longest request)