test_results/ab_c10_n10000_run4.log
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        Werkzeug/1.0.1
Server Hostname:        localhost
Server Port:            5001

Document Path:          /fetch_data
Document Length:        216 bytes

Concurrency Level:      10
Time taken for tests:   123.424 seconds
Complete requests:      10000
Failed requests:        3999
   (Connect: 0, Receive: 0, Length: 3999, Exceptions: 0)
Total transferred:      3615545 bytes
HTML transferred:       2155545 bytes
Requests per second:    81.02 [#/sec] (mean)
Time per request:       123.424 [ms] (mean)
Time per request:       12.342 [ms] (mean, across all concurrent requests)
Transfer rate:          28.61 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       6
Processing:    20  123  16.5    121     220
Waiting:       11  111  14.3    110     202
Total:         20  123  16.4    121     220

Percentage of the requests served within a certain time (ms)
  50%    121
  66%    128
  75%    132
  80%    135
  90%    144
  95%    152
  98%    163
  99%    172
 100%    220 (longest request)