test_results/ab_c10_n10000_run5.log
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        Werkzeug/1.0.1
Server Hostname:        localhost
Server Port:            5001

Document Path:          /fetch_data
Document Length:        216 bytes

Concurrency Level:      10
Time taken for tests:   123.967 seconds
Complete requests:      10000
Failed requests:        4955
   (Connect: 0, Receive: 0, Length: 4955, Exceptions: 0)
Total transferred:      3613724 bytes
HTML transferred:       2153724 bytes
Requests per second:    80.67 [#/sec] (mean)
Time per request:       123.967 [ms] (mean)
Time per request:       12.397 [ms] (mean, across all concurrent requests)
Transfer rate:          28.47 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       8
Processing:    21  123  17.2    121     228
Waiting:       10  112  15.3    110     208
Total:         22  124  17.1    122     229

Percentage of the requests served within a certain time (ms)
  50%    122
  66%    128
  75%    133
  80%    136
  90%    146
  95%    154
  98%    166
  99%    174
 100%    229 (longest request)