test_results/ab_c10_n1000_run1.log
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        Werkzeug/1.0.1
Server Hostname:        localhost
Server Port:            5001

Document Path:          /fetch_data
Document Length:        216 bytes

Concurrency Level:      10
Time taken for tests:   12.476 seconds
Complete requests:      1000
Failed requests:        480
   (Connect: 0, Receive: 0, Length: 480, Exceptions: 0)
Total transferred:      361502 bytes
HTML transferred:       215502 bytes
Requests per second:    80.15 [#/sec] (mean)
Time per request:       124.760 [ms] (mean)
Time per request:       12.476 [ms] (mean, across all concurrent requests)
Transfer rate:          28.30 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.4      0       7
Processing:    18  123  18.7    121     219
Waiting:       10  112  16.9    110     184
Total:         19  124  18.6    122     220
ERROR: The median and mean for the initial connection time are more than twice the standard
       deviation apart. These results are NOT reliable.

Percentage of the requests served within a certain time (ms)
  50%    122
  66%    128
  75%    134
  80%    138
  90%    147
  95%    156
  98%    170
  99%    177
 100%    220 (longest request)