test_results/ab_c10_n1000_run3.log
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        Werkzeug/1.0.1
Server Hostname:        localhost
Server Port:            5001

Document Path:          /fetch_data
Document Length:        216 bytes

Concurrency Level:      10
Time taken for tests:   12.427 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      362000 bytes
HTML transferred:       216000 bytes
Requests per second:    80.47 [#/sec] (mean)
Time per request:       124.267 [ms] (mean)
Time per request:       12.427 [ms] (mean, across all concurrent requests)
Transfer rate:          28.45 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.4      0       7
Processing:    17  123  18.5    121     211
Waiting:        8  112  16.7    110     189
Total:         19  123  18.4    122     211
ERROR: The median and mean for the initial connection time are more than twice the standard
       deviation apart. These results are NOT reliable.

Percentage of the requests served within a certain time (ms)
  50%    122
  66%    128
  75%    133
  80%    136
  90%    145
  95%    155
  98%    167
  99%    174
 100%    211 (longest request)