test_results/ab_c10_n1000_run4.log
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        Werkzeug/1.0.1
Server Hostname:        localhost
Server Port:            5001

Document Path:          /fetch_data
Document Length:        216 bytes

Concurrency Level:      10
Time taken for tests:   12.497 seconds
Complete requests:      1000
Failed requests:        355
   (Connect: 0, Receive: 0, Length: 355, Exceptions: 0)
Total transferred:      361645 bytes
HTML transferred:       215645 bytes
Requests per second:    80.02 [#/sec] (mean)
Time per request:       124.970 [ms] (mean)
Time per request:       12.497 [ms] (mean, across all concurrent requests)
Transfer rate:          28.26 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.4      0       6
Processing:    17  123  16.9    122     201
Waiting:        9  112  15.2    111     171
Total:         18  124  16.8    123     202
ERROR: The median and mean for the initial connection time are more than twice the standard
       deviation apart. These results are NOT reliable.

Percentage of the requests served within a certain time (ms)
  50%    123
  66%    129
  75%    133
  80%    136
  90%    144
  95%    153
  98%    167
  99%    172
 100%    202 (longest request)